//Задача 6.1
//По даденo числo n без използването на цикли да се намери сумата на числата от 1 до n включително.
//
//Пример: n = 5. Тогава сумата е : 1 + 2 + 3 + 4 + 5 = 15
//
//Hint : Колко е сумата на първото с последното число, а на второто и предпоследното ? Как може да се обобщи това свойство ?
//
//Задача 6.2
//Нека се въведе още 1 число m : m > n.Да се намери сумата на числата в интервала[n, m].
//
//Пример: n = 5, m = 10. Тогава сумата е : 5 + 6 + 7 + 8 + 9 + 10 = 45

#include <iostream>
using namespace std;
int main()
{
	double n;
	cin >> n;
	double Sn = (n * (n + 1)) / 2;
	cout << Sn << endl;

	double m;
	cin >> n >> m;
	double Snm = ((n + m) / 2) * (m - n + 1);
	cout << Snm << endl;
}